In [2]:
import pandas as pd

In [21]:
df = pd.read_excel('Expense book.xlsx')

In [22]:
df.set_index('date').head()

            amount type subtype1 subtype2
date
2018-02-17    2.00  f&d    drink        -
2018-02-17    3.00  f&d    drink        -
2018-02-18    7.73  f&d     food      job
2018-02-19    0.59  f&d     food      job
2018-02-20    9.05  f&d     food      job

In [23]:
df.describe()

           amount
count   47.000000
mean     7.263191
std     97.302912
min   -400.000000
25%      3.210000
50%      7.000000
75%     14.670000
max    500.000000

In [26]:
df2 = df.groupby(['subtype1'])

In [27]:
df2.sum()

          amount
subtype1
-         621.63
drink     104.58
food      165.16
job      -400.00
refund   -150.00

In [28]:
df3 = df
df3['amount'] *= -1

In [29]:
df3.head()

        date  amount type subtype1 subtype2
0 2018-02-17   -2.00  f&d    drink        -
1 2018-02-17   -3.00  f&d    drink        -
2 2018-02-18   -7.73  f&d     food      job
3 2018-02-19   -0.59  f&d     food      job
4 2018-02-20   -9.05  f&d     food      job

In [31]:
df3.to_excel('bla.xlsx')

In [72]:
df3 = pd.read_excel('bla.xlsx').set_index('date')

In [32]:
df3.head()

        date  amount type subtype1 subtype2
0 2018-02-17   -2.00  f&d    drink        -
1 2018-02-17   -3.00  f&d    drink        -
2 2018-02-18   -7.73  f&d     food      job
3 2018-02-19   -0.59  f&d     food      job
4 2018-02-20   -9.05  f&d     food      job

In [37]:
df3.replace(to_replace = 'f&d', value = 'food', inplace = True)

In [42]:
df3.drop(columns = ['subtype1', 'subtype2'], inplace = True)

In [43]:
df3.head()

        date  amount  type
0 2018-02-17   -2.00  food
1 2018-02-17   -3.00  food
2 2018-02-18   -7.73  food
3 2018-02-19   -0.59  food
4 2018-02-20   -9.05  food

In [47]:
try:
    open(db='bla.txt','r')
    return 1
except IOError as e:
    e??

SyntaxError: positional argument follows keyword argument (<ipython-input-47-a4d66f6c0314>, line 2)